wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_dsi.c
        /* configure vertical timing parameters */
        DSI_VSACFG = (uint32_t)(hv_count->vsa_count & DSI_VSACFG_VSACNT);
        DSI_VBPCFG = (uint32_t)(hv_count->vbp_count & DSI_VBPCFG_VBPCNT);
        DSI_VFPCFG = (uint32_t)(hv_count->vfp_count & DSI_VFPCFG_VFPCNT);
    }
}

/*!
    \brief      configure horizontal sync active count (API_ID(0x000AU))
    \param[in]  count: horizontal sync active count value
    \param[out] none
    \retval     none
*/
void dsi_horizontal_sync_active_count_set(uint16_t count)
{
    DSI_HSACFG = (uint32_t)(count & DSI_HSACFG_HSACNT);
}

/*!
    \brief      configure horizontal back porch count (API_ID(0x000BU))
    \param[in]  count: horizontal back porch count value
    \param[out] none
    \retval     none
*/
void dsi_horizontal_back_porch_count_set(uint16_t count)
{
    DSI_HBPCFG = (uint32_t)(count & DSI_HBPCFG_HBPCNT);
}

/*!
    \brief      configure horizontal front porch count (API_ID(0x000CU))
    \param[in]  count: horizontal front porch count value
    \param[out] none
    \retval     none
*/
void dsi_horizontal_front_porch_count_set(uint16_t count)
{
    DSI_HFPCFG = (uint32_t)(count & DSI_HFPCFG_HFPCNT);
}

/*!
    \brief      configure horizontal active area count (API_ID(0x000DU))
    \param[in]  count: horizontal active area count value (time for active horizontal address)
    \param[out] none
    \retval     none
*/
void dsi_horizontal_active_count_set(uint16_t count)
{
    DSI_HACFG = (uint32_t)(count & DSI_HACFG_HACNT);
}

/*!
    \brief      configure vertical sync active count (API_ID(0x000EU))
    \param[in]  count: vertical sync active count value
    \param[out] none
    \retval     none
*/
void dsi_vertical_sync_active_count_set(uint16_t count)
{
    DSI_VSACFG = (uint32_t)(count & DSI_VSACFG_VSACNT);
}

/*!
    \brief      configure vertical back porch count (API_ID(0x000FU))
    \param[in]  count: vertical back porch count value
    \param[out] none
    \retval     none
*/
void dsi_vertical_back_porch_count_set(uint16_t count)
{
    DSI_VBPCFG = (uint32_t)(count & DSI_VBPCFG_VBPCNT);
}

/*!
    \brief      configure vertical front porch count (API_ID(0x0010U))
    \param[in]  count: vertical front porch count value
    \param[out] none
    \retval     none
*/
void dsi_vertical_front_porch_count_set(uint16_t count)
{
    DSI_VFPCFG = (uint32_t)(count & DSI_VFPCFG_VFPCNT);
}

/*!
    \brief      enable DSI command is packetised for the DPI's virtual channel (API_ID(0x0011U))
    \param[in]  cmd: DSI command to be enabled
                only one parameter can be selected which is shown as below:
      \arg        DSI_CMD_SHUT_DOWN: DPI shutdown (0x01) command
      \arg        DSI_CMD_TURN_ON: DPI turn on (0x02) command
      \arg        DSI_CMD_COLOR_MODE_ON: color mode on (0x04) command
      \arg        DSI_CMD_COLOR_MODE_OFF: color mode off (0x08) command
    \param[out] none
    \retval     none
*/
void dsi_cmd_pkt_dpi_vchannel_enable(dsi_command_enum cmd)
{
    /* set the appropriate bit for the specified command */
    DSI_DPICTL |= (uint32_t)cmd;
}

/*!
    \brief      disable DSI command is packetised for the DPI's virtual channel (API_ID(0x0012U))
    \param[in]  cmd: DSI command to be disabled
                only one parameter can be selected which is shown as below:
      \arg        DSI_CMD_SHUT_DOWN: DPI shutdown (0x01) command
      \arg        DSI_CMD_TURN_ON: DPI turn on (0x02) command
      \arg        DSI_CMD_COLOR_MODE_ON: color mode on (0x04) command
      \arg        DSI_CMD_COLOR_MODE_OFF: color mode off (0x08) command
    \param[out] none
    \retval     none
*/
void dsi_cmd_pkt_dpi_vchannel_disable(dsi_command_enum cmd)
{
    /* clear the appropriate bit for the specified command */
    DSI_DPICTL &= ~((uint32_t)cmd);
}

/*!
    \brief      set DPI resolution (API_ID(0x0013U))
    \param[in]  hor_resolution: DPI resolution value (horizontal pixels)
    \param[in]  ver_resolution: DPI resolution value (vertical pixels)
    \param[out] none
    \retval     none
*/
void dsi_dpi_resolution_set(uint16_t hor_resolution, uint16_t ver_resolution)
{
    DSI_DPIRES = (uint32_t)((uint32_t)ver_resolution << 16) | (uint32_t)hor_resolution;
}

/*!
    \brief      initialize DSI timing parameters structure with default values (API_ID(0x0014U))
    \param[in]  none
    \param[out] timing_struct: DSI timing parameters struct
    \retval     none
*/
void dsi_timing_struct_para_init(dsi_timing_parameter_struct *timing_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if(NULL == timing_struct) {
        fw_debug_report_err(DSI_MODULE_ID, API_ID(0x0014U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the timing parameters with default values */
        timing_struct->hs_to_count = 0U;
        timing_struct->lp_rx_to_count = 0U;
        timing_struct->ta_to_count = 0U;
        timing_struct->dphy_pll_count = 0U;
        timing_struct->dbi_to_count = 0U;
        timing_struct->lp_bcm_count = 0U;
        timing_struct->hs_switch_count = 0U;
        timing_struct->clk_hs_lp_switch_count = 0U;
        timing_struct->clk_lp_hs_switch_count = 0U;
        timing_struct->init_count = 0U;
    }
}

/*!
    \brief      configure all timing parameters (API_ID(0x0015U))
    \param[in]  timing_struct: DSI timing parameters struct
                  hs_to_count: high-speed transmission timeout counter
                  lp_rx_to_count: low-power reception timeout counter
                  ta_to_count: turn-around timeout counter
                  dphy_pll_count: PLL counter
                  dbi_to_count: DBI interface timeout counter
                  lp_bcm_count: low-power byte clock mode counter
                  hs_switch_count: HS to LP and LP to HS switch count
                  clk_hs_lp_switch_count: clock lane HS to LP switch count
                  clk_lp_hs_switch_count: clock lane LP to HS switch count
                  init_count: DPHY initialization counter
    \param[out] none
    \retval     none
*/
void dsi_timing_config(dsi_timing_parameter_struct *timing_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if(NULL == timing_struct) {
        fw_debug_report_err(DSI_MODULE_ID, API_ID(0x0015U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* configure high-speed transmission timeout */
        DSI_HSTXTO = (uint32_t)(timing_struct->hs_to_count & DSI_HSTXTO_HSTXTOCNT);

