wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_dsi.c
        /* configure low-power reception timeout */
        DSI_LPRXTO = (uint32_t)(timing_struct->lp_rx_to_count & DSI_LPRXTO_LPRXTOCNT);

        /* configure turn-around timeout */
        DSI_TATO = (uint32_t)(timing_struct->ta_to_count & DSI_TATO_TATO);

        /* configure device reset timer */
        DSI_DEVRSTTM = (uint32_t)(timing_struct->dbi_to_count & DSI_DEVRSTTM_DEVRTSTTM);

        /* configure PLL counter */
        DSI_DPHY_PLLLK = (uint32_t)(timing_struct->dphy_pll_count & DSI_DPHY_PLLLK_PLLCNTVAL);

        /* configure data lane high-low switch count */
        DSI_DLCFG = (uint32_t)(timing_struct->hs_switch_count & DSI_DLCFG_DLCFG);

        /* configure clock lane high-low switch count */
        DSI_CKLSWCFG = ((uint32_t)((uint32_t)timing_struct->clk_lp_hs_switch_count << 16U) & DSI_CKLSWCFG_LPHSSW) |
                       ((uint32_t)timing_struct->clk_hs_lp_switch_count & DSI_CKLSWCFG_HSLPSW);

        /* configure low-power byte clock */
        DSI_LPBCLKCFG = (uint32_t)(timing_struct->lp_bcm_count & DSI_LPBCLKCFG_LPBYTECLK);

        /* configure DPHY initialization count */
        DSI_INITCFG = (uint32_t)(timing_struct->init_count & DSI_INITCFG_INITCNT);
    }
}

/*!
    \brief      configure high speed transmission timeout counter (API_ID(0x0016U))
    \param[in]  timeout: high-speed transmission timeout counter value
    \param[out] none
    \retval     none
*/
void dsi_hs_tx_timeout_set(uint32_t timeout)
{
    DSI_HSTXTO = timeout & DSI_HSTXTO_HSTXTOCNT;
}

/*!
    \brief      configure low power reception timeout counter (API_ID(0x0017U))
    \param[in]  timeout: low-power reception timeout counter value
    \param[out] none
    \retval     none
*/
void dsi_lp_rx_timeout_set(uint32_t timeout)
{
    DSI_LPRXTO = timeout & DSI_LPRXTO_LPRXTOCNT;
}

/*!
    \brief      configure turn-around timeout (API_ID(0x0018U))
    \param[in]  timeout: turn-around timeout counter value
    \param[out] none
    \retval     none
*/
void dsi_turnaround_timeout_set(uint8_t timeout)
{
    DSI_TATO = (uint32_t)(timeout & DSI_TATO_TATO);
}

/*!
    \brief      configure device reset timer (API_ID(0x0019U))
    \param[in]  timer: device reset timer value
    \param[out] none
    \retval     none
*/
void dsi_device_reset_timer_set(uint16_t timer)
{
    DSI_DEVRSTTM = (uint32_t)(timer & DSI_DEVRSTTM_DEVRTSTTM);
}

/*!
    \brief      configure DSI initialization counter (API_ID(0x001AU))
    \param[in]  counter: initialization counter value in terms of low power clock
    \param[out] none
    \retval     none
*/
void dsi_init_counter_set(uint16_t counter)
{
    DSI_INITCFG = (uint32_t)(counter & DSI_INITCFG_INITCNT);
}

/*!
    \brief      set the number of data lanes (API_ID(0x001BU))
    \param[in]  number: number of data lanes
                only one parameter can be selected which is shown as below:
      \arg        DSI_DATA_LANE_ONE: one data lane
      \arg        DSI_DATA_LANE_TWO: two data lanes
    \param[out] none
    \retval     none
*/
void dsi_data_lanes_number_set(uint32_t number)
{
    uint32_t reg_val;

    /* configure the number of data lanes */
    reg_val = DSI_FUNCPRG;
    reg_val &= ~DSI_FUNCPRG_DTLANE_PRG;
    reg_val |= number & DSI_FUNCPRG_DTLANE_PRG;
    DSI_FUNCPRG = reg_val;
}

/*!
    \brief      set virtual channel for video mode (API_ID(0x001CU))
    \param[in]  virtual_channel: virtual channel ID
                only one parameter can be selected which is shown as below:
      \arg        DSI_VIRTUAL_CHANNEL_0: virtual channel 0
      \arg        DSI_VIRTUAL_CHANNEL_1: virtual channel 1
      \arg        DSI_VIRTUAL_CHANNEL_2: virtual channel 2
      \arg        DSI_VIRTUAL_CHANNEL_3: virtual channel 3
    \param[out] none
    \retval     none
*/
void dsi_video_mode_virtual_channel_set(uint32_t virtual_channel)
{
    uint32_t reg_val;

    /* set the virtual channel for video mode */
    reg_val = DSI_FUNCPRG;
    reg_val &= ~DSI_FUNCPRG_VCHNUMVM;
    reg_val |= (uint32_t)(virtual_channel << 3) & DSI_FUNCPRG_VCHNUMVM;
    DSI_FUNCPRG = reg_val;
}

/*!
    \brief      set the video mode format (API_ID(0x001DU))
    \param[in]  video_mode: video mode format
                only one parameter can be selected which is shown as below:
      \arg        DSI_VIDEO_MODE_FORMAT_NONE: none video mode format
      \arg        DSI_NON_BURST_MODE_SYNC_PULSE: non burst mode with sync pulse
      \arg        DSI_NON_BURST_MODE_SYNC_EVENTS: non burst mode with sync events
      \arg        DSI_BURST_MODE: burst mode
    \param[out] none
    \retval     none
*/
void dsi_video_mode_format_set(uint8_t video_mode)
{
    DSI_VMFMT &= ~DSI_VMFMT_VMFMT;
    DSI_VMFMT |= video_mode & DSI_VMFMT_VMFMT;
}

/*!
    \brief      set the virtual channel for command mode (API_ID(0x001EU))
    \param[in]  virtual_channel: virtual channel ID
                only one parameter can be selected which is shown as below:
      \arg        DSI_VIRTUAL_CHANNEL_0: virtual channel 0
      \arg        DSI_VIRTUAL_CHANNEL_1: virtual channel 1
      \arg        DSI_VIRTUAL_CHANNEL_2: virtual channel 2
      \arg        DSI_VIRTUAL_CHANNEL_3: virtual channel 3
    \param[out] none
    \retval     none
*/
void dsi_command_mode_virtual_channel_set(uint32_t virtual_channel)
{
    uint32_t reg_val;

    /* set the virtual channel for command mode */
    reg_val = DSI_FUNCPRG;
    reg_val &= ~DSI_FUNCPRG_VCHNUMCM;
    reg_val |= (uint32_t)(virtual_channel << 5) & DSI_FUNCPRG_VCHNUMCM;
    DSI_FUNCPRG = reg_val;
}

/*!
    \brief      set color format for video mode (API_ID(0x001FU))
    \param[in]  color_format: color format
                only one parameter can be selected which is shown as below:
       \arg       DSI_VIDEO_MODE_DISABLE: Video mode is not supported
       \arg       DSI_VIDEO_MODE_FMT_RGB565: RGB565 or 16-bit format
       \arg       DSI_VIDEO_MODE_FMT_RGB666: RGB666 or 18-bit format
       \arg       DSI_VIDEO_MODE_FMT_RGB666LP: RGB666 loosely packed format
       \arg       DSI_VIDEO_MODE_FMT_RGB888: RGB888 or 24-bit format
    \param[out] none
    \retval     none
*/
void dsi_video_mode_color_format_set(uint32_t color_format)
{
    uint32_t reg_val;

    /* set the color format for video mode */
    reg_val = DSI_FUNCPRG;
    reg_val &= ~DSI_FUNCPRG_SFMTVM;
    reg_val |= color_format & DSI_FUNCPRG_SFMTVM;
    DSI_FUNCPRG = reg_val;
}

/*!
    \brief      set data width for command mode (API_ID(0x0020U))
    \param[in]  data_width: data width
                only one parameter can be selected which is shown as below:
       \arg       DSI_CMD_MODE_DTW_8BIT: 8-bit data width
       \arg       DSI_CMD_MODE_DTW_16BIT: 16-bit data width
       \arg       DSI_CMD_MODE_DTW_24BIT: 24-bit data width
    \param[out] none
    \retval     none
*/
void dsi_command_mode_data_width_set(uint32_t data_width)
{
    uint32_t reg_val;

    /* set the data width for command mode */
    reg_val = DSI_FUNCPRG;
    reg_val &= ~DSI_FUNCPRG_SDTWCM;
    reg_val |= data_width & DSI_FUNCPRG_SDTWCM;
    DSI_FUNCPRG = reg_val;
}

/*!
    \brief      configure maximum return packet size and data transfer type (API_ID(0x0021U))
    \param[in]  hplp: data transfer type
                only one parameter can be selected which is shown as below:
       \arg       DSI_TRANSFER_HS: high-speed transfer
       \arg       DSI_TRANSFER_LP: low-power transfer
    \param[in]  size: maximum return packet size in bytes
    \param[out] none
    \retval     none
*/
void dsi_max_return_packet_config(uint16_t hplp, uint16_t size)
{
    DSI_MAXRPKTCTL = (uint32_t)(size & DSI_MAXRPKTCTL_MAXRPKTSZ) | (hplp & DSI_MAXRPKTCTL_HS_LP);
}

/*!
    \brief      set DSI polarity (API_ID(0x0024U))
    \param[in]  polarity: DSI polarity configuration
                only one parameter can be selected which is shown as below:
       \arg       DSI_VSYNC_POLARITY: vsync
       \arg       DSI_HSYNC_POLARITY: hsync
       \arg       DSI_SHUTDOWN_POLARITY: shutdown
       \arg       DSI_COLOR_MODE_POLARITY: color mode
    \param[out] none
    \retval     none
*/
void dsi_polarity_set(uint32_t polarity)
{
    DSI_PLCTL &= ~DSI_PLCTL_PL;
    DSI_PLCTL |= polarity & DSI_PLCTL_PL;
}

/*!
    \brief      swap DSI polarity to active high (API_ID(0x0022U))
    \param[in]  polarity: polarity to swap
                one or more parameters can be selected which are shown as below:
       \arg       DSI_VSYNC_POLARITY_SWAP: vsync polarity swap
       \arg       DSI_HSYNC_POLARITY_SWAP: hsync polarity swap
       \arg       DSI_SHUTDOWN_POLARITY_SWAP: shutdown polarity swap
       \arg       DSI_COLORMODE_POLARITY_SWAP: color mode polarity swap
    \param[out] none
    \retval     none
*/
void dsi_polarity_swap_high(uint32_t polarity)
{
    DSI_PLSWAP |= polarity;
}

/*!
    \brief      swap DSI polarity to active low (API_ID(0x0023U))
    \param[in]  polarity: polarity to swap
                one or more parameters can be selected which are shown as below:
       \arg       DSI_VSYNC_POLARITY_SWAP: vsync polarity swap
       \arg       DSI_HSYNC_POLARITY_SWAP: hsync polarity swap
       \arg       DSI_SHUTDOWN_POLARITY_SWAP: shutdown polarity swap
       \arg       DSI_COLORMODE_POLARITY_SWAP: color mode polarity swap
    \param[out] none
    \retval     none
*/
void dsi_polarity_swap_low(uint32_t polarity)
{
    DSI_PLSWAP &= (uint32_t)~polarity;
}

/*!
    \brief      enable EOT packet transmission (API_ID(0x0024U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void dsi_eot_transmission_enable(void)
{
    uint32_t reg_val;

