wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_dsi.c
#ifdef FW_DEBUG_ERR_REPORT
    /* check for null pointer */
    if(NULL == wms_struct) {
        fw_debug_report_err(DSI_MODULE_ID, API_ID(0x005CU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* Configure WMS control register */
        reg_val = DSI_WWMS_WCTL;
        reg_val &= ~DSI_WWMS_WCTL_WMS_MODE;
        reg_val |= wms_struct->wms_mode & DSI_WWMS_WCTL_WMS_MODE;
        DSI_WWMS_WCTL = reg_val;

        /* Configure WMS header */
        DSI_WWMS_HEAD = ((uint32_t)wms_struct->first_packet_header) |
                        ((uint32_t)wms_struct->second_packet_header << 8U) |
                        ((uint32_t)wms_struct->dcs_command << 16U);

        /* Configure WMS size */
        DSI_WWMS_SIZE = ((uint32_t)wms_struct->packet_length & 0xFFU) |
                        ((uint32_t)wms_struct->total_length << 8U);
    }
}

/*!
    \brief      enable WMS function (API_ID(0x005DU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void dsi_wrapper_wms_enable(void)
{
    DSI_WWMS_WCTL |= DSI_WWMS_WCTL_WMS_EN;
}


/*!
    \brief      set WMS mode (API_ID(0x005FU))
    \param[in]  mode: WMS mode configuration
                only one parameter can be selected which is shown as below:
      \arg        DSI_WMS_MODE_HS: WMS HS mode
      \arg        DSI_WMS_MODE_LP: WMS LP mode
    \param[out] none
    \retval     none
*/
void dsi_wrapper_wms_mode_set(uint32_t mode)
{
    uint32_t reg_val;

    reg_val = DSI_WWMS_WCTL;
    reg_val &= ~DSI_WWMS_WCTL_WMS_MODE;
    reg_val |= mode & DSI_WWMS_WCTL_WMS_MODE;
    DSI_WWMS_WCTL = reg_val;
}

/*!
    \brief      check if WMS end flag is set (API_ID(0x0060U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus dsi_wrapper_wms_end_flag_get(void)
{
    return (DSI_WWMS_WCTL & DSI_WWMS_WCTL_WMS_END) ? SET : RESET;
}

/*!
    \brief      mask or unmask the WMS end interrupt (API_ID(0x0061U))
    \param[in]  state: mask state, ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void dsi_wrapper_wms_end_interrupt_mask(FlagStatus state)
{
    if(state == SET) {
        /* Mask the WMS end interrupt */
        DSI_WWMS_INTMSK |= DSI_WWMS_INTMSK_WMS_ENDMSK;
    } else {
        /* Unmask the WMS end interrupt */
        DSI_WWMS_INTMSK &= ~DSI_WWMS_INTMSK_WMS_ENDMSK;
    }
}

/*!
    \brief      set WMS header messages (API_ID(0x0062U))
    \param[in]  first_header: first split packet head message
    \param[in]  second_header: secondary split packet head message
    \param[in]  dcs_cmd: long packet DCS command
    \param[out] none
    \retval     none
*/
void dsi_wrapper_wms_header_set(uint8_t first_header, uint8_t second_header, uint8_t dcs_cmd)
{
    DSI_WWMS_HEAD = ((uint32_t)first_header) |
                    ((uint32_t)second_header << 8U) |
                    ((uint32_t)dcs_cmd << 16U);
}

/*!
    \brief      set WMS packet length and total length (API_ID(0x0063U))
    \param[in]  packet_length: packet length in words
    \param[in]  total_length: total number of words to be transferred
    \param[out] none
    \retval     none
*/
void dsi_wrapper_wms_size_set(uint8_t packet_length, uint32_t total_length)
{
    DSI_WWMS_SIZE = ((uint32_t)packet_length & 0xFFU) |
                    ((uint32_t)total_length << 8U);
}

/*!
    \brief      get WMS packet number (API_ID(0x0064U))
    \param[in]  none
    \param[out] none
    \retval     uint16_t: current number of packets transferred
*/
uint16_t dsi_wrapper_wms_packet_number_get(void)
{
    return (uint16_t)(DSI_WWMS_STAT0 & DSI_WWMS_STAT0_PKT_NUM);
}

/*!
    \brief      get WMS sum count (API_ID(0x0065U))
    \param[in]  none
    \param[out] none
    \retval     uint32_t: current count of transferred words
*/
uint32_t dsi_wrapper_wms_sum_count_get(void)
{
    return (DSI_WWMS_STAT1 & DSI_WWMS_STAT1_SUM_CNT);
}

/*!
    \brief      check the status of specific FIFO (API_ID(0x0066U))
    \param[in]  fifo_stat: FIFO status to check
                one or more parameters can be selected which are shown as below:
      \arg        DSI_DATA_FIFO_STAT_HS_FULL: HS Generic/DCS data FIFO full
      \arg        DSI_DATA_FIFO_STAT_HS_HALF_EMPTY: HS Generic/DCS data FIFO half empty
      \arg        DSI_DATA_FIFO_STAT_HS_EMPTY: HS Generic/DCS data FIFO empty
      \arg        DSI_DATA_FIFO_STAT_LP_FULL: LP Generic/DCS data FIFO full
      \arg        DSI_DATA_FIFO_STAT_LP_HALF_EMPTY: LP Generic/DCS data FIFO half empty
      \arg        DSI_DATA_FIFO_STAT_LP_EMPTY: LP Generic/DCS data FIFO empty
      \arg        DSI_CTRL_FIFO_STAT_HS_FULL: HS Generic/DCS control FIFO full
      \arg        DSI_CTRL_FIFO_STAT_HS_HALF_EMPTY: HS Generic/DCS control FIFO half empty
      \arg        DSI_CTRL_FIFO_STAT_HS_EMPTY: HS Generic/DCS control FIFO empty
      \arg        DSI_CTRL_FIFO_STAT_LP_FULL: LP Generic/DCS control FIFO full
      \arg        DSI_CTRL_FIFO_STAT_LP_HALF_EMPTY: LP Generic/DCS control FIFO half empty
      \arg        DSI_CTRL_FIFO_STAT_LP_EMPTY: LP Generic/DCS control FIFO empty
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus dsi_fifo_status_get(uint32_t fifo_stat)
{
    return (DSI_FIFOSTAT & fifo_stat) ? SET : RESET;
}

/*!
    \brief      get DSI specific flag status (API_ID(0x0067U))
    \param[in]  flag: flag to check, possible values from dsi_flag_enum:
       \arg       DSI_FLAG_RXSOTE: Rx Sot Error flag
       \arg       DSI_FLAG_RXSOTSYNCE: Rx Sot Sync Error flag
       \arg       DSI_FLAG_RXEOTSYNCE: Rx Eot sync Error flag
       \arg       DSI_FLAG_RXESCMEE: Rx Escape Mode Entry Error flag
       \arg       DSI_FLAG_RXLPTXSYNCE: Rx LP tx sync error flag
       \arg       DSI_FLAG_RXPTOE: Rx Peripheral timeout Error flag
       \arg       DSI_FLAG_RXFCTLE: RxFalse Control Error flag
       \arg       DSI_FLAG_RXECCSE: Rx ECC single bit error flag
       \arg       DSI_FLAG_RXECCME: Rx ECC multibit error flag
       \arg       DSI_FLAG_RXCHKE: Rx checksum error flag
       \arg       DSI_FLAG_RXDSIDTNR: Rx DSI data type not recognised flag
       \arg       DSI_FLAG_RXDSIVCIDINV: Rx DSI virtual channel ID invalid flag
       \arg       DSI_FLAG_TXFCTLE: Tx False Control Error flag
       \arg       DSI_FLAG_TXECCSE: Tx ECC single bit error flag
       \arg       DSI_FLAG_TXECCME: Tx ECC multibit error flag
       \arg       DSI_FLAG_TXCHKE: Tx checksum(CRC) error flag
       \arg       DSI_FLAG_TXDSIDTNR: Tx DSI data type not recognised flag
       \arg       DSI_FLAG_TXDSIVCIDINV: Tx DSI virtual channel ID invalid flag
       \arg       DSI_FLAG_HCONT: high contention flag
       \arg       DSI_FLAG_LCONT: low contention flag
       \arg       DSI_FLAG_FIFOE: FIFO empty flag
       \arg       DSI_FLAG_HSTXTO: HS Tx timeout flag
       \arg       DSI_FLAG_LPRXTO: LP Rx timeout flag
       \arg       DSI_FLAG_TAACKTO: turn around ack timeout flag
       \arg       DSI_FLAG_ACKNE: ACK with No error flag
       \arg       DSI_FLAG_RXINVTXCE: Rx Invalid transmission count error flag
       \arg       DSI_FLAG_RXDSIPV: Rx DSI protocol violation flag
       \arg       DSI_FLAG_SPKTCMDS: special packet command sent flag
       \arg       DSI_FLAG_INIT_DONE: DSI initialisation is done flag
       \arg       DSI_FLAG_RXCONTDET: Rx Contention Detected flag
       \arg       DSI_FLAG_DPILTO: dpi line timeout flag
       \arg       DSI_FLAG_DPIPE: dpi program error flag
       \arg       DSI_FLAG_HSDTFIFOF: HS Generic/DCS data FIFO full flag
       \arg       DSI_FLAG_LPDTFIFOF: LP Generic/DCS data FIFO full flag
       \arg       DSI_FLAG_HSCTLFIFOF: HS Generic/DCS control FIFO full flag
       \arg       DSI_FLAG_LPCTLFIFOF: LP Generic/DCS control FIFO full flag
       \arg       DSI_FLAG_RDDTA: LP Generic/DCS read data available flag
       \arg       DSI_FLAG_TETG: tearing effect(TE) trigger message received flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus dsi_flag_get(dsi_flag_enum flag)
{
    FlagStatus retval = RESET;
    /* check if the flag is set */
    if(DSI_REG_VAL(DSI, flag) & BIT(DSI_BIT_POS(flag))) {
        retval = SET;
    } else {
        /* do nothing */
    }
    return retval;
}

/*!
    \brief      enable DSI specific interrupt (API_ID(0x0068U))
    \param[in]  interrupt: interrupt to enable
                only one parameter can be selected which is shown as below:
       \arg       DSI_INT_RXSOTE: Rx Sot Error interrupt
       \arg       DSI_INT_RXSOTSYNCE: Rx Sot Sync Error interrupt
       \arg       DSI_INT_RXEOTSYNCE: Rx Eot sync Error interrupt
       \arg       DSI_INT_RXESCMEE: Rx Escape Mode Entry Error interrupt
       \arg       DSI_INT_RXLPTXSYNCE: Rx LP tx sync error interrupt
       \arg       DSI_INT_RXPTOE: Rx Peripheral timeout Error interrupt
       \arg       DSI_INT_RXFCTLE: RxFalse Control Error interrupt
       \arg       DSI_INT_RXECCSE: Rx ECC single bit error interrupt
       \arg       DSI_INT_RXECCME: Rx ECC multibit error interrupt
       \arg       DSI_INT_RXCHKE: Rx checksum error interrupt
       \arg       DSI_INT_RXDSIDTNR: Rx DSI data type not recognised interrupt
       \arg       DSI_INT_RXDSIVCIDINV: Rx DSI virtual channel ID invalid interrupt
       \arg       DSI_INT_TXFCTLE: Tx False Control Error interrupt
       \arg       DSI_INT_TXECCSE: Tx ECC single bit error interrupt
       \arg       DSI_INT_TXECCME: Tx ECC multibit error interrupt
       \arg       DSI_INT_TXCHKE: Tx checksum(CRC) error interrupt
       \arg       DSI_INT_TXDSIDTNR: Tx DSI data type not recognised interrupt
       \arg       DSI_INT_TXDSIVCIDINV: Tx DSI virtual channel ID invalid interrupt
       \arg       DSI_INT_HCONT: high contention interrupt
       \arg       DSI_INT_LCONT: low contention interrupt
       \arg       DSI_INT_FIFOE: FIFO empty interrupt
       \arg       DSI_INT_HSTXTO: HS Tx timeout interrupt
       \arg       DSI_INT_LPRXTO: LP Rx timeout interrupt
       \arg       DSI_INT_TAACKTO: turn around ack timeout interrup
       \arg       DSI_INT_ACKNE: ACK with No error interrupt
       \arg       DSI_INT_RXINVTXCE: Rx Invalid transmission count error interrupt
       \arg       DSI_INT_RXDSIPV: Rx DSI protocol violation interrupt
       \arg       DSI_INT_SPKTCMDS: special packet command sent interrupt
       \arg       DSI_INT_INIT_DONE: DSI initialisation is done interrupt
       \arg       DSI_INT_RXCONTDET: Rx Contention Detected interrupt
       \arg       DSI_INT_DPILTO: DPI line timeout interrupt
       \arg       DSI_INT_DPIPE: DPI program error interrupt
     \param[out] none
     \retval     none
*/
void dsi_interrupt_enable(dsi_int_enum interrupt)
{
    DSI_REG_VAL(DSI, interrupt) |= BIT(DSI_BIT_POS(interrupt));
}

/*!
    \brief      disable DSI specific interrupt (API_ID(0x0069U))
    \param[in]  interrupt: interrupt to disable
                only one parameter can be selected which is shown as below:
       \arg       DSI_INT_RXSOTE: Rx Sot Error interrupt
       \arg       DSI_INT_RXSOTSYNCE: Rx Sot Sync Error interrupt
       \arg       DSI_INT_RXEOTSYNCE: Rx Eot sync Error interrupt
       \arg       DSI_INT_RXESCMEE: Rx Escape Mode Entry Error interrupt
       \arg       DSI_INT_RXLPTXSYNCE: Rx LP tx sync error interrupt
       \arg       DSI_INT_RXPTOE: Rx Peripheral timeout Error interrupt
       \arg       DSI_INT_RXFCTLE: RxFalse Control Error interrupt
       \arg       DSI_INT_RXECCSE: Rx ECC single bit error interrupt
       \arg       DSI_INT_RXECCME: Rx ECC multibit error interrupt
       \arg       DSI_INT_RXCHKE: Rx checksum error interrupt
       \arg       DSI_INT_RXDSIDTNR: Rx DSI data type not recognised interrupt
       \arg       DSI_INT_RXDSIVCIDINV: Rx DSI virtual channel ID invalid interrupt
       \arg       DSI_INT_TXFCTLE: Tx False Control Error interrupt
       \arg       DSI_INT_TXECCSE: Tx ECC single bit error interrupt
       \arg       DSI_INT_TXECCME: Tx ECC multibit error interrupt
       \arg       DSI_INT_TXCHKE: Tx checksum(CRC) error interrupt
       \arg       DSI_INT_TXDSIDTNR: Tx DSI data type not recognised interrupt
       \arg       DSI_INT_TXDSIVCIDINV: Tx DSI virtual channel ID invalid interrupt
       \arg       DSI_INT_HCONT: high contention interrupt
       \arg       DSI_INT_LCONT: low contention interrupt
       \arg       DSI_INT_FIFOE: FIFO empty interrupt
       \arg       DSI_INT_HSTXTO: HS Tx timeout interrupt
       \arg       DSI_INT_LPRXTO: LP Rx timeout interrupt
       \arg       DSI_INT_TAACKTO: turn around ack timeout interrup
       \arg       DSI_INT_ACKNE: ACK with No error interrupt
       \arg       DSI_INT_RXINVTXCE: Rx Invalid transmission count error interrupt
       \arg       DSI_INT_RXDSIPV: Rx DSI protocol violation interrupt
       \arg       DSI_INT_SPKTCMDS: special packet command sent interrupt
       \arg       DSI_INT_INIT_DONE: DSI initialisation is done interrupt
       \arg       DSI_INT_RXCONTDET: Rx Contention Detected interrupt
       \arg       DSI_INT_DPILTO: DPI line timeout interrupt
       \arg       DSI_INT_DPIPE: DPI program error interrupt
    \param[out] none
    \retval     none
*/
void dsi_interrupt_disable(dsi_int_enum interrupt)
{
    DSI_REG_VAL(DSI, interrupt) &= ~BIT(DSI_BIT_POS(interrupt));
}

/*!
    \brief      get DSI specific interrupt flag status (API_ID(0x006AU))
    \param[in]  int_flag: interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        DSI_INT_FLAG_RXSOTE: Rx Sot Error interrupt flag
      \arg        DSI_INT_FLAG_RXSOTSYNCE: Rx Sot Sync Error interrupt flag
      \arg        DSI_INT_FLAG_RXEOTSYNCE: Rx Eot sync Error interrupt flag
      \arg        DSI_INT_FLAG_RXESCMEE: Rx Escape Mode Entry Error interrupt flag
      \arg        DSI_INT_FLAG_RXLPTXSYNCE: Rx LP tx sync error interrupt flag
      \arg        DSI_INT_FLAG_RXPTOE: Rx Peripheral timeout Error interrupt flag
      \arg        DSI_INT_FLAG_RXFCTLE: RxFalse Control Error interrupt flag
      \arg        DSI_INT_FLAG_RXECCSE: Rx ECC single bit error interrupt flag
      \arg        DSI_INT_FLAG_RXECCME: Rx ECC multibit error interrupt flag
      \arg        DSI_INT_FLAG_RXCHKE: Rx checksum error interrupt flag
      \arg        DSI_INT_FLAG_RXDSIDTNR: Rx DSI data type not recognised interrupt flag
      \arg        DSI_INT_FLAG_RXDSIVCIDINV: Rx DSI virtual channel ID invalid interrupt flag
      \arg        DSI_INT_FLAG_TXFCTLE: Tx False Control Error interrupt flag
      \arg        DSI_INT_FLAG_TXECCSE: Tx ECC single bit error interrupt flag
      \arg        DSI_INT_FLAG_TXECCME: Tx ECC multibit error interrupt flag
      \arg        DSI_INT_FLAG_TXCHKE: Tx checksum(CRC) error interrupt flag
      \arg        DSI_INT_FLAG_TXDSIDTNR: Tx DSI data type not recognised interrupt flag
      \arg        DSI_INT_FLAG_TXDSIVCIDINV: Tx DSI virtual channel ID invalid interrupt flag
      \arg        DSI_INT_FLAG_HCONT: high contention interrupt flag
      \arg        DSI_INT_FLAG_LCONT: low contention interrupt flag
      \arg        DSI_INT_FLAG_FIFOE: FIFO empty interrupt flag
      \arg        DSI_INT_FLAG_HSTXTO: HS Tx timeout interrupt flag
      \arg        DSI_INT_FLAG_LPRXTO: LP Rx timeout interrupt flag
      \arg        DSI_INT_FLAG_TAACKTO: turn around ack timeout interrupt flag
      \arg        DSI_INT_FLAG_ACKNE: ACK with No error interrupt flag
      \arg        DSI_INT_FLAG_RXINVTXCE: Rx Invalid transmission count error interrupt flag
      \arg        DSI_INT_FLAG_RXDSIPV: Rx DSI protocol violation interrupt flag
      \arg        DSI_INT_FLAG_SPKTCMDS: special packet command sent interrupt flag
      \arg        DSI_INT_FLAG_INIT_DONE: DSI initialisation is done interrupt flag
      \arg        DSI_INT_FLAG_RXCONTDET: Rx Contention Detected interrupt flag
      \arg        DSI_INT_FLAG_DPILTO: DPI line timeout interrupt flag
      \arg        DSI_INT_FLAG_DPIPE: DPI program error interrupt flag
      \arg        DSI_INT_FLAG_HSDTFIFOF: HS Generic/DCS data FIFO full flag
      \arg        DSI_INT_FLAG_LPDTFIFOF: LP Generic/DCS data FIFO full flag
      \arg        DSI_INT_FLAG_HSCTLFIFOF: HS Generic/DCS control FIFO full flag
      \arg        DSI_INT_FLAG_LPCTLFIFOF: LP Generic/DCS control FIFO full flag
      \arg        DSI_INT_FLAG_RDDTA: LP Generic/DCS read data available flag
      \arg        DSI_INT_FLAG_TETG: tearing effect(TE) trigger message received flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus dsi_interrupt_flag_get(dsi_int_flag_enum int_flag)
{
    uint32_t interrupt_enable = 0U;
    uint32_t interrupt_flag = 0U;
    FlagStatus retval = RESET;

    /* check interrupt flag */
    interrupt_flag = DSI_REG_VAL(DSI, int_flag) & BIT(DSI_BIT_POS(int_flag));

    /* check interrupt enable */
    if((uint32_t)(int_flag) >> 22 != 0U) {
        interrupt_enable = DSI_REG_VAL2(DSI, int_flag) & BIT(DSI_BIT_POS2(int_flag));
    } else {
        interrupt_enable = 0x01U;
    }

