wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Source/gd32h77x_dsi.c
    /* check if the flag is set and enabled */
    if(interrupt_flag && interrupt_enable) {
        retval = SET;
    } else {
        /* do nothing */
    }
    return retval;
}

/*!
    \brief      clear DSI specific interrupt flag (API_ID(0x006BU))
    \param[in]  int_flag: interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        DSI_INT_FLAG_RXSOTE: Rx Sot Error interrupt flag
      \arg        DSI_INT_FLAG_RXSOTSYNCE: Rx Sot Sync Error interrupt flag
      \arg        DSI_INT_FLAG_RXEOTSYNCE: Rx Eot sync Error interrupt flag
      \arg        DSI_INT_FLAG_RXESCMEE: Rx Escape Mode Entry Error interrupt flag
      \arg        DSI_INT_FLAG_RXLPTXSYNCE: Rx LP tx sync error interrupt flag
      \arg        DSI_INT_FLAG_RXPTOE: Rx Peripheral timeout Error interrupt flag
      \arg        DSI_INT_FLAG_RXFCTLE: RxFalse Control Error interrupt flag
      \arg        DSI_INT_FLAG_RXECCSE: Rx ECC single bit error interrupt flag
      \arg        DSI_INT_FLAG_RXECCME: Rx ECC multibit error interrupt flag
      \arg        DSI_INT_FLAG_RXCHKE: Rx checksum error interrupt flag
      \arg        DSI_INT_FLAG_RXDSIDTNR: Rx DSI data type not recognised interrupt flag
      \arg        DSI_INT_FLAG_RXDSIVCIDINV: Rx DSI virtual channel ID invalid interrupt flag
      \arg        DSI_INT_FLAG_TXFCTLE: Tx False Control Error interrupt flag
      \arg        DSI_INT_FLAG_TXECCSE: Tx ECC single bit error interrupt flag
      \arg        DSI_INT_FLAG_TXECCME: Tx ECC multibit error interrupt flag
      \arg        DSI_INT_FLAG_TXCHKE: Tx checksum(CRC) error interrupt flag
      \arg        DSI_INT_FLAG_TXDSIDTNR: Tx DSI data type not recognised interrupt flag
      \arg        DSI_INT_FLAG_TXDSIVCIDINV: Tx DSI virtual channel ID invalid interrupt flag
      \arg        DSI_INT_FLAG_HCONT: high contention interrupt flag
      \arg        DSI_INT_FLAG_LCONT: low contention interrupt flag
      \arg        DSI_INT_FLAG_FIFOE: FIFO empty interrupt flag
      \arg        DSI_INT_FLAG_HSTXTO: HS Tx timeout interrupt flag
      \arg        DSI_INT_FLAG_LPRXTO: LP Rx timeout interrupt flag
      \arg        DSI_INT_FLAG_TAACKTO: turn around ack timeout interrupt flag
      \arg        DSI_INT_FLAG_ACKNE: ACK with No error interrupt flag
      \arg        DSI_INT_FLAG_RXINVTXCE: Rx Invalid transmission count error interrupt flag
      \arg        DSI_INT_FLAG_RXDSIPV: Rx DSI protocol violation interrupt flag
      \arg        DSI_INT_FLAG_SPKTCMDS: special packet command sent interrupt flag
      \arg        DSI_INT_FLAG_INIT_DONE: DSI initialisation is done interrupt flag
      \arg        DSI_INT_FLAG_RXCONTDET: Rx Contention Detected interrupt flag
      \arg        DSI_INT_FLAG_DPILTO: DPI line timeout interrupt flag
      \arg        DSI_INT_FLAG_DPIPE: DPI program error interrupt flag
      \arg        DSI_INT_FLAG_HSDTFIFOF: HS Generic/DCS data FIFO full flag
      \arg        DSI_INT_FLAG_LPDTFIFOF: LP Generic/DCS data FIFO full flag
      \arg        DSI_INT_FLAG_HSCTLFIFOF: HS Generic/DCS control FIFO full flag
      \arg        DSI_INT_FLAG_LPCTLFIFOF: LP Generic/DCS control FIFO full flag
      \arg        DSI_INT_FLAG_RDDTA: LP Generic/DCS read data available flag
      \arg        DSI_INT_FLAG_TETG: tearing effect(TE) trigger message received flag
    \param[out] none
    \retval     none
*/
void dsi_interrupt_flag_clear(dsi_int_flag_enum int_flag)
{
    DSI_REG_VAL(DSI, int_flag) |= BIT(DSI_BIT_POS(int_flag));
}

/*!
    \brief      get DSI wrapper specific flag status (API_ID(0x006CU))
    \param[in]  flag: flag to check
                only one parameter can be selected which is shown as below:
      \arg        DSI_FLAG_TE: tearing effect flag
      \arg        DSI_FLAG_PLL_LOCK: PLL lock flag
      \arg        DSI_FLAG_PLL_UNLOCK: PLL unlock flag
      \arg        DSI_FLAG_PLL_LOCK_STAT: PLL lock status
      \arg        DSI_FLAG_WMS_END: write memory split packet end flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus dsi_wrapper_flag_get(dsi_wrapper_flag_enum flag)
{
    FlagStatus retval = RESET;
    /* check if the flag is set */
    if(DSI_REG_VAL(DSI, flag) & BIT(DSI_BIT_POS(flag))) {
        retval = SET;
    } else {
        /* do nothing */
    }
    return retval;
}

/*!
    \brief      enable DSI wrapper specific interrupt (API_ID(0x006DU))
    \param[in]  interrupt: interrupt to enable
                only one parameter can be selected which is shown as below:
       \arg       DSI_INT_TE: tearing effect interrupt
       \arg       DSI_INT_PLL_LOCK: PLL lock interrupt
       \arg       DSI_INT_PLL_UNLOCK: PLL unlock interrupt
       \arg       DSI_INT_WMS_END_MSK: write memory split packet WMS_END flag interrupt signal mask
    \param[out] none
    \retval     none
*/
void dsi_wrapper_interrupt_enable(dsi_wrapper_int_enum interrupt)
{
    DSI_REG_VAL(DSI, interrupt) |= BIT(DSI_BIT_POS(interrupt));
}

/*!
    \brief      disable DSI wrapper specific interrupt (API_ID(0x006EU))
    \param[in]  interrupt: interrupt to disable
                only one parameter can be selected which is shown as below:
       \arg       DSI_INT_TE: tearing effect interrupt
       \arg       DSI_INT_PLL_LOCK: PLL lock interrupt
       \arg       DSI_INT_PLL_UNLOCK: PLL unlock interrupt
       \arg       DSI_INT_WMS_END_MSK: write memory split packet WMS_END flag interrupt signal mask
    \param[out] none
    \retval     none
*/
void dsi_wrapper_interrupt_disable(dsi_wrapper_int_enum interrupt)
{
    DSI_REG_VAL(DSI, interrupt) &= ~BIT(DSI_BIT_POS(interrupt));
}

/*!
    \brief      get DSI wrapper specific interrupt flag status (API_ID(0x006FU))
    \param[in]  int_flag: interrupt flag to check
                only one parameter can be selected which is shown as below:
       \arg       DSI_INT_FLAG_TE: tearing effect flag
       \arg       DSI_INT_FLAG_PLL_LOCK: PLL lock flag
       \arg       DSI_INT_FLAG_PLL_UNLOCK: PLL unlock flag
       \arg       DSI_INT_FLAG_PLL_LOCK_STAT: PLL lock status
       \arg       DSI_INT_FLAG_WMS_END: write memory split packet end flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus dsi_wrapper_interrupt_flag_get(dsi_wrapper_int_flag_enum int_flag)
{
    FlagStatus retval = RESET;
    /* check if the flag is set */
    if(DSI_REG_VAL(DSI, int_flag) & BIT(DSI_BIT_POS(int_flag))) {
        retval = SET;
    } else {
        /* do nothing */
    }
    return retval;
}

/*!
    \brief      clear DSI wrapper specific interrupt flag (API_ID(0x0070U))
    \param[in]  int_flag: interrupt flag to clear
                only one parameter can be selected which is shown as below:
       \arg       DSI_INT_FLAG_TE_CLR: tearing effect flag clear
       \arg       DSI_INT_FLAG_PLL_LOCK_CLR: PLL lock flag clear
       \arg       DSI_INT_FLAG_PLL_UNLOCK_CLR: PLL unlock flag clear
       \arg       DSI_INT_FLAG_WMS_END_CLR: write memory split packet end flag
    \param[out] none
    \retval     none
*/
void dsi_wrapper_interrupt_flag_clear(dsi_wrapper_int_flag_clr_enum int_flag)
{
    DSI_REG_VAL(DSI, int_flag) |= BIT(DSI_BIT_POS(int_flag));
}
